[
  {
    "id": "1745415777891",
    "title": "Meet Chenille: Our Sweetest Little Snuggle Bug!",
    "body": "We're thrilled to introduce you to Chenille, our adorable cream-colored girl who's an absolute expert at cuddling! With her soft, fluffy coat and gentle eyes, Chenille has quickly become the sweetheart of our home.\r\n\r\nChenille loves nothing more than curling up in a warm lap or nestling close to you for endless snuggle sessions. She's playful yet incredibly affectionate, making her the perfect companion for cozy evenings and heartwarming moments.\r\n\r\nStay tuned as we continue to share more updates and adorable photos of Chenille as she grows. She's bound to steal your heart just as she's stolen ours!\r\n\r\nInterested in welcoming Chenille into your home? Reach out to learn more about adopting this little cuddle champion!",
    "images": [
      "/uploads/1745415777889-pegah-mostafavizadeh-4dBce3hxiVY-unsplash.jpg"
    ],
    "comments": [
      {
        "email": "test@email.com",
        "comment": "She's so cute!!!",
        "createdAt": "2025-04-24T17:48:22.153Z"
      },
      {
        "email": "test2@email.com",
        "comment": "So tiny!",
        "createdAt": "2025-04-24T18:28:52.549Z"
      }
    ]
  },
  {
    "id": "1745360214231",
    "title": "They’re Here: Meet Our Adorable New Arrivals!",
    "body": "We have fantastic news to share—our sweet Pomeranian Cashmere just welcomed three beautiful puppies into the world! It was an amazing experience, and we’re over the moon with excitement.\r\n\r\nCashmere handled everything like the champ she is, and she’s doing wonderfully—resting comfortably and showing all the signs of a happy, loving mom. Watching her gently care for her puppies is truly heartwarming.\r\n\r\nThese three little bundles of joy are already stealing our hearts with their tiny paws and adorable faces. They’re healthy, lively, and absolutely perfect!\r\n\r\nOur puppies will be visiting the vet soon for their first check-up to make sure everything is going great, and we’ll continue to monitor their progress closely. Once they reach eight weeks old and have had their initial vet visits, vaccinations, and health checks, they’ll be ready to find their forever homes!\r\n\r\nWe’ll keep everyone updated with plenty of photos and adorable moments as they grow and develop their unique personalities. Stay tuned to our blog for regular updates, and don’t hesitate to reach out if you’re interested in providing a loving home for one of our precious pups.\r\n\r\nWe can’t wait to share more of their journey with you!",
    "images": [
      "/uploads/1745360214212-ian-deneumostier-APVBt7gCujU-unsplash.jpg",
      "/uploads/1745360214222-ian-deneumostier-VOVzREXqsNk-unsplash.jpg"
    ],
    "comments": [
      {
        "email": "test@email.com",
        "comment": "OMG! When can I meet them?!",
        "createdAt": "2025-04-24T17:48:56.177Z"
      }
    ]
  }
]